zhjiehua/PadPrinter/PadPrinter_STM8S/Logic/management.c
#include "management.h"
#include "project.h"
#include "misc.h"
#include "actions.h"

#include "simplc_io.h"
#include "simplc_timer.h"

#include <stm8s.h>
#include "io.h"
#include "uart1.h"
#include "tm1638.h"
#include "flash_eeprom.h"
#include "24cxx.h"
#include "tim5.h"

//如果自编程需要手动则将该宏改为1
#define PROGRAMSELF_ACTION  0


//按键刷新
void Key_Refresh(void)
{
    uint8_t key = TM1638_ReadKey(0);
    uint8_t i;

    for(i=0;i<8;i++)
        SML(i, 0);

    if(key)
        SML(TM1638_ReadKey(0)-1, 1);
}

//编写自编程序
void ProgramSelf(void)
{
    if(GMR(M_PROGRAM_SELF))
    {
        ProgramRead();
        
        project.programSelfPos = 0;
        
        sprintf((char*)project.segStr, "%02d-", project.programSelfPos);
        TM1638_SendData(0, project.segStr);
        
        project.pCurProSelfAction = project.program + project.programSelfPos;
        
        sprintf((char*)project.segStr, "%02d", project.pCurProSelfAction->act);
        TM1638_SendData(3, project.segStr);
    }
  
    if(GMR(M_KEY_FAST))//加步骤
    {
        project.programSelfPos++;
        if(project.programSelfPos >= MAX_ACTIONS_PER_PROJECT-1)
            project.programSelfPos = 0;
        
        project.pCurProSelfAction = project.program + project.programSelfPos;
        
        sprintf((char*)project.segStr, "%02d-", project.programSelfPos);
        TM1638_SendData(0, project.segStr);
        
        sprintf((char*)project.segStr, "%02d", project.pCurProSelfAction->act);
        TM1638_SendData(3, project.segStr);
    }
    else if(GMR(M_KEY_SLOW))//减步骤
    {
        project.programSelfPos--;
        if(project.programSelfPos >= 255)
            project.programSelfPos = MAX_ACTIONS_PER_PROJECT-1;
        
        project.pCurProSelfAction = project.program + project.programSelfPos;
        
        sprintf((char*)project.segStr, "%02d-", project.programSelfPos);
        TM1638_SendData(0, project.segStr);
        
        sprintf((char*)project.segStr, "%02d", project.pCurProSelfAction->act);
        TM1638_SendData(3, project.segStr);
    }
    
    //--------------------------------------------------------------------------------------
    if(GMR(M_KEY_UPDOWN))//加程序
    {
        SML(M_PROGRAM_SELF_CHANGE, 1);
        
        if(project.printHeadPos&FRONTBACK_MASK)
        {
            if(project.printHeadPos&UPDOWN_MASK)
            {
#if PROGRAMSELF_ACTION
                //PrintUp();
                SML(M_MAN_UPDOWN, 1);
                SML(M_MODE_MANUAL, 1);
#else
                project.printHeadPos &= ~UPDOWN_MASK;          
#endif
                project.pCurProSelfAction->act = PRINT_UP;
            }
            else
            {
#if PROGRAMSELF_ACTION
                //PrintDown();
                SML(M_MAN_UPDOWN, 1);
                SML(M_MODE_MANUAL, 1);
#else
                project.printHeadPos |= UPDOWN_MASK; 
#endif
                project.pCurProSelfAction->act = PRINT_DOWN;
            }
        }
        else
        {
#if PROGRAMSELF_ACTION   
            //Absorb();
            SML(M_MAN_UPDOWN, 1);
            SML(M_MODE_MANUAL, 1);
#endif
            
            project.pCurProSelfAction->act = ABSORB;
        }
        
        project.programSelfPos++;
        if(project.programSelfPos >= MAX_ACTIONS_PER_PROJECT-3)
            project.programSelfPos = 0;
        
        project.pCurProSelfAction = project.program + project.programSelfPos;
        
        sprintf((char*)project.segStr, "%02d-", project.programSelfPos);
        TM1638_SendData(0, project.segStr);
        
        sprintf((char*)project.segStr, "%02d", project.pCurProSelfAction->act);
        TM1638_SendData(3, project.segStr);
    }
    else if(GMR(M_KEY_FRONTBACK))//减程序
    {
        SML(M_PROGRAM_SELF_CHANGE, 1);   
      
        if(project.printHeadPos&UPDOWN_MASK)
        {
            ;
        }
        else
        {
            if(project.printHeadPos&FRONTBACK_MASK)
            {
                //Back();
#if PROGRAMSELF_ACTION            
                SML(M_MAN_FRONTBACK, 1);
                SML(M_MODE_MANUAL, 1);
#else
                project.printHeadPos &= ~FRONTBACK_MASK;
#endif
            
                project.pCurProSelfAction->act = BACK;
            }
            else
            {
#if PROGRAMSELF_ACTION            
                SML(M_MAN_FRONTBACK, 1);
                SML(M_MODE_MANUAL, 1);
#else
                project.printHeadPos |= FRONTBACK_MASK;
#endif
                project.pCurProSelfAction->act = FRONT;
            }

            
        }
        
        project.programSelfPos++;
        if(project.programSelfPos >= MAX_ACTIONS_PER_PROJECT-3)
            project.programSelfPos = 0;
        
        project.pCurProSelfAction = project.program + project.programSelfPos;
        
        sprintf((char*)project.segStr, "%02d-", project.programSelfPos);
        TM1638_SendData(0, project.segStr);
        
        sprintf((char*)project.segStr, "%02d", project.pCurProSelfAction->act);
        TM1638_SendData(3, project.segStr);
    }
    
    if(GMR(M_KEY_AUX))//修改flag
    {
        SML(M_PROGRAM_SELF_CHANGE, 1);

#if PROGRAMSELF_ACTION  
        //Shift();
        SML(M_MAN_AUX, 1);
        SML(M_MODE_MANUAL, 1);
#endif
        
        if(project.machineType == MACHINE_2SENSORS)
        {
            if(!project.platformPushFlag)
            {
                project.pCurProSelfAction->act = PUSH;
                project.platformPushFlag = 1;
            }
            else
            {
                project.pCurProSelfAction->act = RETURN;
                project.platformPushFlag = 0;
            }
        }
        else
            project.pCurProSelfAction->act = SHIFT;
        
        project.programSelfPos++;
        if(project.programSelfPos >= MAX_ACTIONS_PER_PROJECT-3)
            project.programSelfPos = 0;
        
        project.pCurProSelfAction = project.program + project.programSelfPos;
        
        sprintf((char*)project.segStr, "%02d-", project.programSelfPos);
        TM1638_SendData(0, project.segStr);
        
        sprintf((char*)project.segStr, "%02d", project.pCurProSelfAction->act);
        TM1638_SendData(3, project.segStr);
    }
    
    if(GMR(M_KEY_STARTSTOP))
    {
        if(GML(M_PROGRAM_SELF_CHANGE))
        {
            UART1_printf("Saving the Program0...\r\n");
            
            project.pCurProSelfAction->act = HOME;
            project.programSelfPos++;
            project.pCurProSelfAction = project.program + project.programSelfPos;
            project.pCurProSelfAction->act = ACTION_NONE;
            
            Program0Save();
            
            //
            project.programNum = 0;
            AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM_NUM, project.programNum);
            AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM_NUM, project.programNum);
            AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM_NUM, project.programNum);
        }
        
        UART1_printf("Saved the Program0 finish!\r\n");
        
        project.mode = NORMAL;
        
        SML(M_SEG_FLASH, 1);
       
        while(1);
    }

#if PROGRAMSELF_ACTION  
    
