zhjiehua/PadPrinter/PadPrinter_STM8S/Logic/management.c
    if(GML(M_MODE_MANUAL))
    {
        if(GML(M_MAN_FRONTBACK))
        {
            if(project.printHeadPos&UPDOWN_MASK)
            {
                UART1_printf("Warnning : Can not run the Back or Front action!\r\n");
            }
            else
            {
                if(project.printHeadPos&FRONTBACK_MASK)
                {
                    Back();
                }
                else
                {
                    Front();
                }
            }
        }
        
        if(GML(M_MAN_UPDOWN))
        {
            if(project.printHeadPos&FRONTBACK_MASK)
            {
                if(project.printHeadPos&UPDOWN_MASK)
                {
                    PrintUp();
                }
                else
                {
                    PrintDown();
                }
            }
            else
            {
                Absorb();
            }
        }
        
        if(GML(M_MAN_AUX))
        {
            if(project.machineType == MACHINE_2SENSORS)
            {
                if(project.platformPushFlag)
                    Push();
                else
                    Return();
            }
            else
            {
                if(GML(M_MAN_AUX_RETURN))
                    Return();
                else
                    Shift();
                
                SML(M_MAN_FLAG_AUX, 1);
            }
        }
        
        if(!GML(M_MAN_UPDOWN) && !GML(M_MAN_FRONTBACK) && !GML(M_MAN_AUX))
            SML(M_MODE_MANUAL, 0);
    }
#endif
    
}

//选择程序
void ProgramSelect(void)
{
    if(GMR(M_PROGRAM_SEL))//刷新一次上次关机前的程序序号
    {
        UART1_printf("Selecting Program...\r\n");
        
        //读取程序序号
        project.programNum = AT24CXX_ReadOneByte(EEPROM_ADDR_PROGRAM_NUM);
        
        //刷新数码管
        sprintf((char*)project.segStr, "Pro%02d", project.programNum);
        TM1638_SendData(0, project.segStr);
    }
    
    if(GMR(M_KEY_SLOW))//加程序  M_KEY_FAST  M_KEY_SLOW
    {
        if(!GML(M_INTSET))
        {
            if(project.programNum >= PROJECTNUM-1)
                project.programNum = 0;
            else
                project.programNum++;
            
            //刷新数码管
            sprintf((char*)project.segStr, "Pro%02d", project.programNum);
            TM1638_SendData(0, project.segStr);
        }
        else
        {
            project.intSetPos++;
            if(project.intSetPos > 10)
                project.intSetPos = 0;
            
            sprintf((char*)project.segStr, "%02d-", project.intSetPos);
            TM1638_SendData(0, project.segStr);
        }
    }
    else if(GMR(M_KEY_FAST))//减程序
    {
        if(!GML(M_INTSET))
        {
            if(project.programNum <= 0)
                project.programNum = PROJECTNUM-1;
            else
                project.programNum--;
            
            //刷新数码管
            sprintf((char*)project.segStr, "Pro%02d", project.programNum);
            TM1638_SendData(0, project.segStr);
        }
        else
        {
            project.intSetPos--;
            if(project.intSetPos >= 255)
                project.intSetPos = 10;
            
            sprintf((char*)project.segStr, "%02d-", project.intSetPos);
            TM1638_SendData(0, project.segStr);
        }
    }
    else if(GMR(M_KEY_STARTSTOP))//选定程序，更新project结构体
    {
        if(!GML(M_INTSET))
        {
            //保存程序序号到EEPROM
            AT24CXX_WriteOneByte(EEPROM_ADDR_PROGRAM_NUM, project.programNum);
            
            UART1_printf("The selected Program is %s\r\n", project.segStr);
            
            //选择完后退出选择程序
//            if(project.programNum == 0)
//            {
//                project.mode = PROGRAM_SELF;
//                SML(M_PROGRAM_SELF, 1);
//            }
//            else
            {
                project.mode = NORMAL;
                SML(M_PROGRAM_READ, 1);
            }
        }
        else//-------------------------------------------------------------------------------
        {
            SML(M_INTSET, 0);
            
            switch(project.intSetPos)
            {
                case 0:
                    if(project.intSetVal)
                    {
                        AT24CXX_WriteOneByte(EEPROM_ADDR_DEFAULT, 0xAA);
                        UART1_printf("Reset default data!\r\n");
                    }
                    else
                        AT24CXX_WriteOneByte(EEPROM_ADDR_DEFAULT, 0x55);
                break;
                case 1:
                    if(project.intSetVal > 0)
                    {
                        AT24CXX_WriteLenByte(EEPROM_ADDR_ACTIONUNITDELAY, 40*project.intSetVal, 2);
                        UART1_printf("Change the actionUnitDelay is %d!\r\n", 40*project.intSetVal);
                    }
                    else
                    {
                        AT24CXX_WriteLenByte(EEPROM_ADDR_ACTIONUNITDELAY, 1, 2);
                        UART1_printf("Change the actionUnitDelay is 1!\r\n");
                    }
                break;
                default:
                break;
            }
        }
    }
    else if(GMR(M_KEY_AUX))
    {
        if(!GML(M_INTSET))
        {
            project.intSetAuxCnt++;
            if(project.intSetAuxCnt >= 10)
            {
                sprintf((char*)project.segStr, "%02d-%02d", project.intSetPos, project.intSetVal);
                TM1638_SendData(0, project.segStr);
                
                SML(M_INTSET, 1);
            }
        }
    }
    else if(GML(M_INTSET))
    {
        if(GMR(M_KEY_UPDOWN))
        {
            project.intSetVal++;
            if(project.intSetVal > 10)
                project.intSetVal = 0;
            
            sprintf((char*)project.segStr, "%02d", project.intSetVal);
            TM1638_SendData(3, project.segStr);
        }
        else if(GMR(M_KEY_FRONTBACK))
        {
            project.intSetVal--;
            if(project.intSetVal >= 255)
                project.intSetVal = 10;
            
