zhjiehua/PadPrinter/PadPrinter_STM8S/Logic/management.c
            sprintf((char*)project.segStr, "%02d", project.intSetVal);
            TM1638_SendData(3, project.segStr);
        }
    }
}

//正常启动后的按键识别
void Key_Distinguish(void)
{
    if(GML(M_CAN_CHANGE_DELAY))
    {
        if(TG(1))
        {
            if(GML(M_KEY_SLOW))//快  M_KEY_SLOW  M_KEY_FAST
            {
                SML(M_OUTPUT_FLASH_FLAG, 0);
                SML(M_SAVE_DELAY, 1);

                project.pCurAction->delay++;
                if(project.pCurAction->delay > MAX_ACTIONUNIT_DELAY)
                    project.pCurAction->delay = MAX_ACTIONUNIT_DELAY;
                
                project.pCurAction->flag |= 0x80;//修改标志位，提示需要保存
                
                //UART1_printf("Add delay time.\r\n");
                
                sprintf((char*)project.segStr, "%5d", project.pCurAction->delay);
                TM1638_SendData(0, project.segStr);
            }
            else if(GML(M_KEY_FAST))//慢
            {
                SML(M_OUTPUT_FLASH_FLAG, 0);
                SML(M_SAVE_DELAY, 1);
                
                project.pCurAction->delay--;
                if(project.pCurAction->delay == 0 || project.pCurAction->delay >= MAX_ACTIONUNIT_DELAY)
                    project.pCurAction->delay = 0;
                
                project.pCurAction->flag |= 0x80;//修改标志位，提示需要保存
                
                //UART1_printf("Dec delay time.\r\n");
                
                sprintf((char*)project.segStr, "%5d", project.pCurAction->delay);
                TM1638_SendData(0, project.segStr);
            }
            else
                SML(M_OUTPUT_FLASH_FLAG, 1);
            
            TS(1, DELAY_KEY_FILTER_PERIOD);
        }
    }
    
    if(GML(M_MODE_AUTO))//正在执行自动程序
    {
        if(GMR(M_KEY_STARTSTOP))
        {
            SML(M_CHANGEMODE_PAUSE, 1);
            
            UART1_printf("Stop the program.\r\n");
            
            SML(M_PROGRAM_FOOT, 1);//表示开机后已按过启动
        }
        if(GMR(M_KEY_AUX))//辅助
        {
            if(!GML(M_PROGRAM_AUX))
            {
                SML(M_PROGRAM_AUX, 1);
                
                //SML(M_MAN_FLAG_AUX, 0);
                
                SML(M_AUTO_FLAG_AUX, 1);
                
                UART1_printf("Add the auxiliary action to current program.\r\n");
            }
        }
        if(GMR(M_KEY_FOOT))//脚踏
        {
            SML(M_CHANGEMODE_PAUSE, 1);
            
            UART1_printf("Foot---Stop the program.\r\n");
        }
    }
    else// if(project.programMode == MANUAL)
    {
        if(GMR(M_KEY_STARTSTOP))//启动停止
        {
            if(!GML(M_ADJ_DELAY))
            {
                if(GML(M_FLAG_MANUAL))
                {
                    SML(M_FLAG_MANUAL, 0);
                    
                    UART1_printf("\r\nRestore the initial status.\r\n");
                    
                    SML(M_MODE_RESTORE, 1);
                    
                    //SML(M_PROGRAM_AUX, 0);
                    
                    if(project.printHeadPos&UPDOWN_MASK)
                        SML(M_RESTORE_UP, 1);
                    
                    SML(M_RESTORE_HOME, 1);
                }
                else
                {
                    SML(M_MODE_AUTO, 1);//启动自动程序
                    
                    UART1_printf("Start the program...\r\n");
                }
                
                
                //
            }
            else
            {
                sprintf((char*)project.segStr, "%05d", project.productOutput);
                TM1638_SendData(0, project.segStr);
                
                AT24CXX_WriteOneByte(project.programAddr+project.actionPos*3+2, project.pCurAction->delay);
                AT24CXX_WriteOneByte(project.programAddr+project.actionPos*3+2, project.pCurAction->delay);
                AT24CXX_WriteOneByte(project.programAddr+project.actionPos*3+2, project.pCurAction->delay);
                
                SML(M_ADJ_DELAY, 0);
            }
            
            SML(M_PROGRAM_FOOT, 1);//表示开机后已按过启动
        }
        if(GMR(M_KEY_AUX))//辅助
        {
            SML(M_MODE_MANUAL, 1);
            
            SML(M_FLAG_MANUAL, 1);
            
            SML(M_MAN_AUX, 1);
        }
        if(GMR(M_KEY_UPDOWN))//上下
        {
            SML(M_MODE_MANUAL, 1);
            
            SML(M_FLAG_MANUAL, 1);
            
            SML(M_MAN_UPDOWN, 1);
        }
        if(GMR(M_KEY_FRONTBACK))//前后
        {
            SML(M_MODE_MANUAL, 1);
            
            SML(M_FLAG_MANUAL, 1);
            
            SML(M_MAN_FRONTBACK, 1);
        }
        if(GMR(M_KEY_FOOT))//脚踏
        {
            if(!GML(M_PROGRAM_FOOT))
            {
                SML(M_PROGRAM_PERIOD, 1);
            }
            
            SML(M_MODE_AUTO, 1);
        }
    }
}

//进入下一个动作
void NextAction(void)
{
    if(!GML(M_PROGRAM_AUX))
    {
        do
        {
            project.actionPos++;
            if(project.actionPos >= project.actionCnt)
            {
                project.productOutput++;
                //sprintf((char*)project.segStr, "%05d", project.productOutput);
                //TM1638_SendData(0, project.segStr);
                
                AT24CXX_WriteLenByte(EEPROM_ADDR_PRODUCTOUTPUT, project.productOutput, 2);
                
                if(GML(M_PROGRAM_PERIOD))
                {
                    SML(M_MODE_AUTO, 0);
                    SML(M_PROGRAM_PERIOD, 0);
                }
                
                //保存修改过的延时参数
                if(GML(M_SAVE_DELAY))
                {   
                    uint8_t i;
                    //ACTION_TypeDef *pCurDelayAction;
                  
                    for(i=0;i<project.actionCnt;i++)
                    {
                        project.pCurDelayAction = project.program + i;
                        if(project.pCurDelayAction->flag&0x80)
                        {
                            project.pCurDelayAction->flag &= ~0x80;
                            
                            IWDG_ReloadCounter();
                            
                            AT24CXX_WriteOneByte(project.programAddr+i*3+2, project.pCurDelayAction->delay);
                            AT24CXX_WriteOneByte(project.programAddr+i*3+2, project.pCurDelayAction->delay);
                            AT24CXX_WriteOneByte(project.programAddr+i*3+2, project.pCurDelayAction->delay);
                            
                            IWDG_ReloadCounter();
                            
                            UART1_printf("Save the action %d delay : %d\r\n", i, project.pCurDelayAction->delay);
                        }
                    }
                    SML(M_SAVE_DELAY, 0);
                }
                
                project.actionPos = 0;
                
