zhjiehua/PadPrinter/PadPrinter_STM8S/Logic/management.c
                UART1_printf("\r\n");
            }
            
            project.pCurAction = project.program + project.actionPos; 
        }while(!(project.pCurAction->flag&0x01));
        
        if(project.pCurAction->act == ABSORB
           || project.pCurAction->act == ABSORB_DOWN
           || project.pCurAction->act == PRINT
           || project.pCurAction->act == PRINT_DOWN)
        {
            SML(M_CAN_CHANGE_DELAY, 1);
        }
        else
            SML(M_CAN_CHANGE_DELAY, 0);
    }
    else
    {
        project.actionPos++;
        if(project.actionPos >= project.actionCnt)
        {
            project.productOutput++;
            //sprintf((char*)project.segStr, "%05d", project.productOutput);
            //TM1638_SendData(0, project.segStr);
            
            AT24CXX_WriteLenByte(EEPROM_ADDR_PRODUCTOUTPUT, project.productOutput, 2);
            
            if(GML(M_PROGRAM_PERIOD))
            {
                SML(M_MODE_AUTO, 0);
                SML(M_PROGRAM_PERIOD, 0);
            }
            
            //保存修改过的延时参数
            if(GML(M_SAVE_DELAY))
            {
                uint8_t i;
                //ACTION_TypeDef *pCurDelayAction;
              
                for(i=0;i<project.actionCnt;i++)
                {
                    project.pCurDelayAction = project.program + i;
                    if(project.pCurDelayAction->flag&0x80)
                    {
                        project.pCurDelayAction->flag &= ~0x80;
                        
                        IWDG_ReloadCounter();
                        
                        AT24CXX_WriteOneByte(project.programAddr+i*3+2, project.pCurDelayAction->delay);
                        AT24CXX_WriteOneByte(project.programAddr+i*3+2, project.pCurDelayAction->delay);
                        AT24CXX_WriteOneByte(project.programAddr+i*3+2, project.pCurDelayAction->delay);
                        
                        IWDG_ReloadCounter();
                        
                        UART1_printf("Save the action %d delay : %d\r\n", i, project.pCurDelayAction->delay);
                    }
                }
                SML(M_SAVE_DELAY, 0);
            }
            
            project.actionPos = 0;
            
            UART1_printf("\r\n");
        }
        
        project.pCurAction = project.program + project.actionPos;
        
        if(project.pCurAction->act == ABSORB
           || project.pCurAction->act == ABSORB_DOWN
           || project.pCurAction->act == PRINT
           || project.pCurAction->act == PRINT_DOWN)
        {
            SML(M_CAN_CHANGE_DELAY, 1);
        }
        else
        {
            SML(M_CAN_CHANGE_DELAY, 0);
        }
    }
    
    if(!(project.printHeadPos&UPDOWN_MASK))//暂停不能压
    {
        if(GML(M_CHANGEMODE_PAUSE))
        {
            SML(M_MODE_AUTO, 0);
            SML(M_CHANGEMODE_PAUSE, 0);
        }
    }
    
    project.delay = (*(project.pCurAction)).delay;
    
    if(GML(M_AUTO_FLAG_AUX))
    {
        SML(M_AUTO_FLAG_AUX, 0);
        
        SML(M_MODE_AUTO, 0);
        SML(M_MODE_RESTORE, 1);
        
        if(project.printHeadPos&UPDOWN_MASK)
            SML(M_RESTORE_UP, 1);
        
        SML(M_RESTORE_HOME, 1);
        
        UART1_printf("\r\nRestore the initial status.\r\n");
    }
}

void Home_Check(void)
{
    if(project.machineType == MACHINE_4SENSORS)
    {
        if(project.platformState == 1)
        {
            if(!GXL(X_SHIFT_L2))
            {
                SYL(Y_POS, 0);//再将定位气缸收回来
                
                project.platformState = 2;
            }
//            else
//                UART1_printf("Action----Home Return----Waiting for X_SHIFT_L2\r\n");
        }
        else if(project.platformState == 2)
        {
            if(GXL(X_SHIFT_O))
            {
                SML(M_HOME_FINISH, 1);
                SML(M_HOME_CHECK, 0);
                
                project.platformPos = 0;
                
                project.platformState = 0;
                
                UART1_printf("Action----Home Return----Finish\r\n");
            }
//            else
//                UART1_printf("Action----Home Return----Waiting for X_SHIFT_O\r\n");
        }
    }
    else
    {
        if(GXL(X_POS))
        {
            SML(M_HOME_FINISH, 1);
            SML(M_HOME_CHECK, 0);
            
            project.platformPos = 0;
            
            project.platformState = 0;
            
            UART1_printf("Action----Home Return----Finish\r\n");
        }
    }
}

void Push_Check(void)
{
    if(project.platformState == 1)
    {
        if(GXL(X_SHIFT_L1))
        {
            SYL(Y_SHIFT, 0);
            
            project.platformPos = 1;
            project.platformState = 2;
        }
    }
    else if(project.platformState == 2)
    {
        if(GXL(X_POS))
        {
            SYL(Y_POS, 0);  
          
            SML(M_HOME_FINISH, 1);
            SML(M_PUSH_CHECK, 0);
            
            project.platformPos = 0;
            
            project.platformState = 0;
            
            UART1_printf("Action----PushHome----Finish\r\n");
        }
    }
}

void Push2_Check(void)
{
    if(project.platformState == 1)
    {
        if(GXL(X_SHIFT_L1))
        {
            SYL(Y_SHIFT, 0);
            
            project.platformPos = 1;
            project.platformState = 2;
        }
    }
    else if(project.platformState == 2)
    {
        if(GXL(X_POS))
        {
            SYL(Y_POS, 0);  
          
            //SML(M_HOME_FINISH, 1);
            //SML(M_PUSH_CHECK, 0);
            
            project.platformPos = 0;
            
            project.platformState = 3;
            
            //UART1_printf("Action----PushHome----Finish\r\n");
        }
    }
    else if(project.platformState == 3)
    {
        SYL(Y_SHIFT, 1);
        SYL(Y_POS, 1);
        
        project.platformState = 4;
    }
    else if(project.platformState == 4)
    {
        if(GXL(X_SHIFT_L1))
        {
            SYL(Y_SHIFT, 0);
            
            //SML(M_HOME_FINISH, 1);
            
            project.platformPos = 1;
            project.platformState = 5;
        }
    }
    else if(project.platformState == 5)
    {
        if(GXL(X_POS))
        {
            SYL(Y_POS, 0);  
          
            SML(M_HOME_FINISH, 1);
            SML(M_PUSH2_CHECK, 0);
            
            project.platformPos = 0;
            
            project.platformState = 0;
            
            UART1_printf("Action----Push2Home----Finish\r\n");
        }
    }
}
